; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph2 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	infrared3 - mode
	Star3 - direction
	Star4 - direction
	Star8 - direction
	Star6 - direction
	Star1 - direction
	Star7 - direction
	Star0 - direction
	Star2 - direction
	Star5 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star6)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star7)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
)
(:goal (and
	(have_image Phenomenon9 spectrograph0)
	(have_image Planet10 spectrograph0)
	(have_image Planet11 thermograph2)
	(have_image Star12 spectrograph1)
	(have_image Phenomenon13 thermograph2)
	(have_image Planet14 spectrograph0)
))

)

; plan
1. (turn_to satellite0 star7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite0 instrument1 star7)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite0 star12 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star12)
   goals met: 0 of 6
5. (take_image satellite0 star12 instrument1 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 1 of 6
6. (turn_to satellite0 star0 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star0)
   goals met: 1 of 6
7. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 6
8. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 6
9. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 1 of 6
10. (turn_to satellite0 phenomenon13 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 6
11. (take_image satellite0 phenomenon13 instrument2 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 2 of 6
12. (turn_to satellite0 phenomenon9 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 6
13. (take_image satellite0 phenomenon9 instrument2 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 3 of 6
14. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 3 of 6
15. (take_image satellite0 planet10 instrument2 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 4 of 6
16. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 4 of 6
17. (take_image satellite0 planet11 instrument2 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 5 of 6
18. (turn_to satellite0 planet14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet14)
   goals met: 5 of 6
19. (take_image satellite0 planet14 instrument2 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 6 of 6
